> It happens all the time: someone gives you data containing malformed strings,  Python, lists and missing data. How do you tidy it up so you can get on with the  analysis? <br>
Take this monstrosity as the DataFrame to use in the following puzzles:<br> 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

> 1.) Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

In [42]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [43]:
df.at[1,'FlightNumber']=10055
df.at[3,'FlightNumber']=10075

In [44]:
df['FlightNumber']=df['FlightNumber'].astype('int64')

In [45]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

> 2.) The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [46]:
from_=[]
to_=[]
for i in df['From_To']:
    values=i.split('_')
    from_.append(values[0])
    to_.append(values[1])
df1=df.copy()    
df1.insert(0,'From',from_,False)
df1.insert(1,'To',to_,False)
df1.drop(columns='From_To',inplace=True)

> 3.) Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [47]:
from_caps=[i.capitalize() for i in df1['From']]
df1['From']=from_caps

to_caps=[i.capitalize() for i in df1['To']]
df1['To']=to_caps

In [48]:
df1.head()

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

> 4.) Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [49]:
df.drop(columns='From_To',inplace=True)
df = df1.copy()
df.head()

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

> 5.) In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN.

In [50]:
df2=pd.DataFrame(df.RecentDelays.values.tolist()).add_prefix('RecentDelays_')

df2.head()

   RecentDelays_0  RecentDelays_1  RecentDelays_2
0            23.0            47.0             NaN
1             NaN             NaN             NaN
2            24.0            43.0            87.0
3            13.0             NaN             NaN
4            67.0            32.0             NaN

In [51]:
df.drop(columns='RecentDelays',inplace=True)
df = pd.concat([df, df2], axis=1)

In [52]:
df.head()

,From,To,FlightNumber,Airline,RecentDelays_0,RecentDelays_1,RecentDelays_2
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN